'''
#-------------1-----------
mask = 255.254.0.0
sett = 11111111.11111110.00000000.00000000
2 ** 17 - 2
131070
'''

#--------------2------------
'''
sett = 192.168.31.0
mask = 255.255.255.0
2 ** 8 - 2 - 10
244
'''

#--------3--------
'''
devc = 192.168.1.1
mask = 255.192.0.0
devc = 11000000.10101000.00000001.00000001
mask = 11111111.11000000.00000000.00000000
sett = 11000000.10000000.00000000.00000000
10000000
'''

#--------------4---------
'''
devc = 205.99.68.249
mask = 255.255.248.0
devc = 11001101.01100011.01000100.11111001
mask = 11111111.11111111.11111000.00000000
sett = 11001101.01100011.01000000.00000000
neww = 11001101.01100011.01000111.11111110
neww = 205.99.71.254
2059971254
'''
#-------------5--------------
'''
devc = 49.26.38.163
mask = 255.255.255.192
devc = 00110001.00011010.00100110.10100011
mask = 11111111.11111111.11111111.11000000
sett = 00110001.00011010.00100110.10000000

(2 ** 6 - 2) / 2

from ipaddress import *

ip_net = ip_network("49.26.38.163/255.255.255.192", False)

c = 0
for i in ip_net:
    c += 1
print((c - 2) / 2)
'''
#------------6---------
'''
from ipaddress import *

#При худшем исходе последние 4 бита IP будут "1111"
#Поэтому bin(35) -> 00100011 превращается в 00110 + 1111
#Слева 8 нулей, справа 3 + A.count("0")
#8 <= 3 + A.count("0") ; A.count("0") >= 5
#Нам надо получить максимальное, поэтому эти 5 нулей в конец
#int("11100000", 2) -> 224
a = []
for i in range(9):
    A = int(((i * "1" + 8 * "0")[:8]), 2)
    net = ip_network(f"248.112.{A}.35/255.255.255.240", False)
    for ip in net:
        ip = (bin(int(ip)))[2:]
        if ip[:16].count("0") == ip[-16:].count("0"):
            a.append(A)
            break
print(a[0])
'''
#-------------7--------------
'''
from ipaddress import *

#Нужно получить минимальный, поэтому от большего к меньшему
for i in range(31, 0, -1):
    net = ip_network(f"242.190.196.159/{i}", False)
    shirokovesh = net.broadcast_address
    # if "242.190.196.159" != shirokovesh НЕПРАВИЛЬНо
    if IPv4Address("242.190.196.159") != shirokovesh:
        print(i)
        break

#242.     190.     196.     159
#11110010.10111110.11000100.10011111
#Answ: 26
#11111111.11111111.11111111.11
#Справа налево считаем, когда хостовая часть будет содержать
#хотя бы один 0 (чтобы не был широковещательным) и хотя бы
#одну 1 (чтобы не был адресом сети)
'''
#-----------8----------
'''
from ipaddress import *

#devc = 111.081.093.127
#devc = 01101111.01010001.01011101
#sett = 111.081.080.0         ^
#sett = 01101111.01010001.01010000
#mask = 255.255.              ^
#int("11110000", 2) -> 240
'''
#---------9-------------
'''
from ipaddress import *

#Наименьшее кол-во нулей в маске?
#devc = 117.73.208.27
#devc = 01110101.01001001.11010000.00011011
#sett = 117.73.192.0
#sett = 01110101.01001001.11000000.00000000
#mask = 11111111.11111111.111
'''
#-------------10------------
'''
from ipaddress import *

net = ip_network("192.168.63.0/255.255.255.128", False)

c = 0
for ip in net:
    ip = (bin(int(ip)))[2:]
    if ip.count("0") % 5 != 0:
        c += 1
print(c)
'''
#--------------11------------
'''
from ipaddress import *

a = []
net = ip_network("172.17.167.18/255.255.240.0", False)
for ip in net:
    shirok = net.broadcast_address
    if IPv4Address(f"{ip}") != shirok:
        a.append(ip)
print(a[-1])
'''
#----------------12-----------
'''
from ipaddress import *

net = ip_network("192.168.32.160/255.255.255.240", False)
c = 0
for ip in net:
    ip = (bin(int(ip)))[2:]
    if ip.count("0") > 21:
        c += 1

print(c)
'''
#----------------13-----------
'''
from ipaddress import *

# devc = 192.168.76.160
# devc = 11000000.10101000.01001100.10100000
# mask = 11111111.11111111.11111111.11110000
# sett = 11000000.10101000.01001100.10100000

# .hosts() позволяет не учитывать адрес самой сети
net = ip_network("192.168.76.160/255.255.255.240", False).hosts()
c = 0
for ip in net:
    ip = (bin(int(ip)))[2:]
    if ip[-1] == "0" and ip[-8:].count("1") % 2 == 0:
        print(ip, ip[-8:], ip[-8:].count("1"), int(ip[-8:], 2)) 
'''
#---------14--------
from ipaddress import *

net = ip_network("195.102.65.64/255.255.255.192")
c = 0
for ip in net:
    ip = (bin(int(ip)))[2:]
    if ip[-8:].count("1") == 4:
        c += 1
        print(ip, ip[-8:], ip[-8:].count("1"), int(ip[-8:], 2))
print(c)

































