#----------1------------
"""
# i - битовая глубина
for i in range(100):
    t = 1 # т.к. пропускная способность в Кбайт/с
    k = 2 # 2 канала
    v = 32000 # частота 32 КГц
    I = t * k * v * i # общий объем (за t секунд)
    sgatie = 0.32 # сжимает на 68% (до 32%)
    Prop_sposob = 40 * 2 ** 13 # пропускная способность 40 Кбайт/с
    if I * sgatie >= Prop_sposob:
        print(i)
        break
"""
#----------------2--------------
"""
t = 5 * 2 ** 33 / (2 * 48000 * 8)
print(t / 60 / 60)
"""
#--------------3---------------
k = 2
V = 44100
i = 32
I = 50 * 2 ** 23
t = I / (k * i * V)
print(t / 60)















